RRN_Data/2398400/2398451.xml

<?xml version="1.0" encoding="UTF-8"?><soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope"><soap:Body><d2LogicalModel xmlns="http://datex2.eu/schema/2/2_0" modelBaseVersion="2"><exchange><supplierIdentification><country>fr</country><nationalIdentifier>Tipi</nationalIdentifier></supplierIdentification><subscription><operatingMode>operatingMode1</operatingMode><subscriptionStartTime>2025-03-26T16:34:42.447+01:00</subscriptionStartTime><subscriptionState>active</subscriptionState><updateMethod>allElementUpdate</updateMethod><target><address/><protocol/></target></subscription></exchange><payloadPublication xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="SituationPublication" lang="fr"><publicationTime>2025-03-26T16:34:42.447+01:00</publicationTime><publicationCreator><country>fr</country><nationalIdentifier>Tipi</nationalIdentifier></publicationCreator><situation id="250326-001382" version="3"><overallSeverity>medium</overallSeverity><situationVersionTime>2025-03-26T16:34:41.870+01:00</situationVersionTime><headerInformation><confidentiality>noRestriction</confidentiality><informationStatus>real</informationStatus></headerInformation><situationRecord xsi:type="MaintenanceWorks" id="250326-001382-1" version="3"><situationRecordCreationTime>2025-03-26T13:44:05.348+01:00</situationRecordCreationTime><situationRecordObservationTime>2025-03-26T16:34:41.870+01:00</situationRecordObservationTime><situationRecordVersionTime>2025-03-26T16:34:41.870+01:00</situationRecordVersionTime><situationRecordFirstSupplierVersionTime>2025-03-26T13:44:05.348+01:00</situationRecordFirstSupplierVersionTime><probabilityOfOccurrence>certain</probabilityOfOccurrence><source><sourceIdentification>Direction interdépartementale des routes/DIR Atlantique</sourceIdentification><sourceName><values><value lang="fr">CEI de Montlieu-la-Garde</value></values></sourceName><reliable>true</reliable></source><validity><validityStatus>definedByValidityTimeSpec</validityStatus><validityTimeSpecification><overallStartTime>2025-03-26T13:44:05.348+01:00</overallStartTime><overallEndTime>2025-03-26T17:30:00.000+01:00</overallEndTime><validPeriod><periodName><values><value lang="FR">Uniquement de jour</value></values></periodName></validPeriod></validityTimeSpecification></validity><impact><numberOfLanesRestricted>1</numberOfLanesRestricted><originalNumberOfLanes>2</originalNumberOfLanes><trafficConstrictionType>lanesBlocked</trafficConstrictionType></impact><generalPublicComment><comment><values><value lang="fr">DIR Atlantique/District d'Angoulême/CEI de Montlieu-la-Garde</value></values></comment><commentType>locationDescriptor</commentType></generalPublicComment><generalPublicComment><comment><values><value lang="fr">Point particulier : début : situé 3012 m au sud de Bédenac, fin : situé 1192 m au nord de Laruscade</value></values></comment><commentType>locationDescriptor</commentType></generalPublicComment><generalPublicComment><comment><values><value lang="fr">De Paris vers Bordeaux</value></values></comment><commentType>locationDescriptor</commentType></generalPublicComment><groupOfLocations xsi:type="Linear"><supplementaryPositionalDescription><affectedCarriagewayAndLanes><carriageway>mainCarriageway</carriageway><lane>lane1</lane></affectedCarriagewayAndLanes></supplementaryPositionalDescription><tpegLinearLocation><tpegDirection>southBound</tpegDirection><tpegLinearLocationType>segment</tpegLinearLocationType><to xsi:type="TpegNonJunctionPoint"><pointCoordinates><latitude>45.118744</latitude><longitude>-0.37598217</longitude></pointCoordinates><name><descriptor><values><value lang="fr">Laruscade</value></values></descriptor><tpegOtherPointDescriptorType>townName</tpegOtherPointDescriptorType></name><name><descriptor><values><value lang="fr">N10</value></values></descriptor><tpegOtherPointDescriptorType>linkName</tpegOtherPointDescriptorType></name></to><from xsi:type="TpegNonJunctionPoint"><pointCoordinates><latitude>45.122314</latitude><longitude>-0.37536356</longitude></pointCoordinates><name><descriptor><values><value lang="fr">Laruscade</value></values></descriptor><tpegOtherPointDescriptorType>townName</tpegOtherPointDescriptorType></name><name><descriptor><values><value lang="fr">N10</value></values></descriptor><tpegOtherPointDescriptorType>linkName</tpegOtherPointDescriptorType></name></from></tpegLinearLocation><alertCLinear xsi:type="AlertCMethod4Linear"><alertCLocationCountryCode>F</alertCLocationCountryCode><alertCLocationTableNumber>32</alertCLocationTableNumber><alertCLocationTableVersion>11.0</alertCLocationTableVersion><alertCDirection><alertCDirectionCoded>positive</alertCDirectionCoded></alertCDirection><alertCMethod4PrimaryPointLocation><alertCLocation><alertCLocationName><values><value lang="fr">Laruscade</value></values></alertCLocationName><specificLocation>19120</specificLocation></alertCLocation><offsetDistance><offsetDistance>1192</offsetDistance></offsetDistance></alertCMethod4PrimaryPointLocation><alertCMethod4SecondaryPointLocation><alertCLocation><alertCLocationName><values><value lang="fr">Bédenac</value></values></alertCLocationName><specificLocation>19119</specificLocation></alertCLocation><offsetDistance><offsetDistance>3012</offsetDistance></offsetDistance></alertCMethod4SecondaryPointLocation></alertCLinear><linearWithinLinearElement><directionRelativeOnLinearSection>aligned</directionRelativeOnLinearSection><linearElement><roadNumber>N0010</roadNumber></linearElement><fromPoint xsi:type="DistanceFromLinearElementReferent"><distanceAlong>200.0</distanceAlong><fromReferent><referentIdentifier>33PR6D</referentIdentifier><referentType>referenceMarker</referentType></fromReferent></fromPoint><toPoint xsi:type="DistanceFromLinearElementReferent"><distanceAlong>800.0</distanceAlong><fromReferent><referentIdentifier>33PR5D</referentIdentifier><referentType>referenceMarker</referentType></fromReferent></toPoint></linearWithinLinearElement></groupOfLocations><management><lifeCycleManagement><end>true</end></lifeCycleManagement></management><situationRecordExtension><situationRecordExtendedApproved><safetyRelatedMessage>false</safetyRelatedMessage></situationRecordExtendedApproved></situationRecordExtension><roadworksScale>medium</roadworksScale><roadMaintenanceType>maintenanceWork</roadMaintenanceType></situationRecord></situation></payloadPublication></d2LogicalModel></soap:Body></soap:Envelope>